{
  "_name_or_path": "pedramyazdipoor/persian_xlm_roberta_large",
  "architectures": [
    "XLMRobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "0": "SAD",
    "1": "HATE",
    "2": "OTHER",
    "3": "FEAR",
    "4": "ANGRY",
    "5": "HAPPY",
    "6": "SURPRISE"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "ANGRY": 4,
    "FEAR": 3,
    "HAPPY": 5,
    "HATE": 1,
    "OTHER": 2,
    "SAD": 0,
    "SURPRISE": 6
  },
  "language": "english",
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "xlm-roberta",
  "name": "XLMRoberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "output_past": true,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.35.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 250002
}
